Repository: IzbassarO/Latynize
Catalog: Latynize/Resources/Localizable.xcstrings
Source language: en
Languages: kk, ru

source: %lld conversions
kk: %lld түрлендіру
ru: %lld конверсий

source: %lld selected
kk: %lld таңдалды
ru: %lld выбранных

source: %lld words
kk: %lld сөз
ru: %lld слов

# %lld words · %lld chars
source: %1$lld words · %2$lld chars
kk: %lld сөз · %lld таңба
ru: %lld слов · %lld симв.

source: 1 conversion
kk: 1 түрлендіру
ru: 1 конверсия

source: About
kk: Қолданба туралы
ru: О приложении

source: All
kk: Барлығы
ru: Все

source: All conversions
kk: Барлық түрлендірулер
ru: Все преобразования

source: All Conversions
kk: Барлық түрлендірулер
ru: Все конверсии

source: All saved conversions will be permanently deleted.
kk: Барлық сақталған түрлендірулер өшіріледі.
ru: Все сохранённые конверсии будут удалены.

source: Alphabet Reference
kk: Әліпби
ru: Алфавит

source: Appearance
kk: Сыртқы түрі
ru: Внешний вид

source: Auto-detect Cyrillic or Latin input
kk: Кирилл не латынды автоанықтау
ru: Определять кириллицу или латиницу

source: Auto-save history
kk: Тарихта сақтау
ru: Сохранять в историю

source: Background
kk: Негіз
ru: Предыстория

source: Camera
kk: Камера
ru: Камера

source: Camera OCR
kk: Мәтінді тану
ru: Распознавание текста

source: Cancel
kk: Болдырмау
ru: Отмена

source: Choose Photo
kk: Фото таңдау
ru: Выбрать фото

source: Clear
kk: Тазалау
ru: Очистить

source: Clear all history?
kk: Барлық тарихты тазалау керек пе?
ru: Очистить всю историю?

source: Clear conversion history
kk: Тарихты тазалау
ru: Очистить историю

source: Compare standards
kk: Стандарттарды салыстыру
ru: Сравнить стандарты

source: Continue
kk: Жалғастыру
ru: Продолжить

source: Conversion Standard
kk: Түрлендіру стандарты
ru: Стандарт конверсии

source: Convert
kk: Түрлендіру
ru: Конвертировать

source: Convert some text and it will automatically appear here.
kk: Мәтінді түрлендіріңіз, ол\nосы жерде пайда болады.
ru: Конвертируйте текст и он\nпоявится здесь.

source: Convert text from any app — Safari, Mail, Messages, and more.
kk: Кез келген қолданбадан мәтінді түрлендіріңіз — Safari, Mail, Хабарлар және басқалары.
ru: Конвертируйте текст из любого приложения — Safari, Mail, Сообщения и других.

source: Converted
kk: Нәтиже
ru: Результат

source: Converted text will appear here
kk: Нәтиже осы жерде көрінеді
ru: Результат появится здесь

source: Copied to clipboard
kk: Көшірілді
ru: Скопировано

source: Copy
kk: Көшіру
ru: Копировать

source: Cyrillic
kk: Кирилл
ru: Кириллица

source: Dark
kk: Қараңғы
ru: Тёмная

source: Dark Mode
kk: Қара тақырып
ru: Тёмная тема

source: Data
kk: Деректер
ru: Данные

source: Date
kk: Күні
ru: Дата

source: Delete
kk: Жою
ru: Удалить

source: Delete All
kk: Барлығын жою
ru: Удалить всё

source: Deselect All
kk: Барлығын таңдауды алып тастаңыз
ru: Отменить выбор всех

source: Details
kk: Толығырақ
ru: Подробнее

source: Direction
kk: Бағыт
ru: Направление

source: Done
kk: Дайын
ru: Готово

source: English
kk: Ағылшын
ru: Английский

source: Example
kk: Мысал
ru: Пример

source: EXAMPLE
kk: МЫСАЛ
ru: ПРИМЕР

source: Export
kk: Экспорт
ru: Экспорт

source: Export All
kk: Барлығын экспорттау
ru: Экспорт всего

source: Export Favorites
kk: Таңдаулыларды экспорттау
ru: Экспорт избранного

source: Export Selected
kk: Экспорттау таңдалды
ru: Экспорт выбранного

source: Export this conversion as a formatted document.
kk: Бұл түрлендіруді пішімделген құжат ретінде экспорттаңыз.
ru: Экспортируйте результаты преобразования в отформатированный документ.

source: Export to PDF
kk: PDF-ке экспорттау
ru: Экспорт в PDF

source: Favorite
kk: Таңдаулыға
ru: В избранное

source: Favorites
kk: Таңдаулылар
ru: Избранное

source: Favorites only
kk: Тек таңдаулылар
ru: Только избранные

source: Format
kk: Формат
ru: Формат

source: Formatted, printable
kk: Пішімделген, басып шығаруға болады
ru: Форматированный, пригодный для печати

source: Get Started
kk: Бастау
ru: Начать

source: Haptic feedback
kk: Вибрация
ru: Вибрация

source: History
kk: Тарих
ru: История

source: Home Screen Widget
kk: Басты экран виджеті
ru: Виджет главного экрана

source: Kazakh
kk: Қазақша
ru: Казахский

source: Kazakhstan is transitioning its Kazakh-language alphabet from Cyrillic to Latin script. The reform started in 2017 with a phased transition planned through 2031. The 2021 version is widely considered the final candidate.
kk: Қазақстан қазақ әліпбиін кириллицадан латынға көшіруде. Реформа 2017 жылы басталды, кезең-кезеңмен көшу 2031 жылға дейін жоспарланған. 2021 жылғы нұсқа соңғы нұсқа болып саналады.
ru: Казахстан переводит казахский алфавит с кириллицы на латиницу. Реформа началась в 2017 году, поэтапный переход планируется до 2031 года. Версия 2021 года считается финальной.

source: Language
kk: Тіл
ru: Язык

source: Last 7 Days
kk: Соңғы 7 күн
ru: Последние 7 дней

source: Latin
kk: Латын
ru: Латын

source: Latynize — Kazakh Script Converter All processing happens on-device. No data leaves your phone.
kk: Latynize — Қазақ жазуын түрлендіруші Барлығы құрылғыда өңделеді. Деректер жіберілмейді.
ru: Latynize — Конвертер казахской письменности Всё обрабатывается на устройстве. Данные не передаются.

source: Latynize now follows your system theme — or pick your favorite.
kk: Latynize енді жүйелік тақырыпты ұстанады — немесе өзіңізге ұнайтынды таңдаңыз.
ru: Latynize теперь следует системной теме — или выберите свою.

source: Learn Kazakh Latin letters daily.
kk: Қазақ латын әріптерін күн сайын үйреніңіз.
ru: Изучайте казахские латинские буквы каждый день.

source: Learn one Kazakh Latin letter every day with examples.
kk: Күн сайын бір қазақ латын әріпін мысалдармен үйреніңіз.
ru: Изучайте по одной казахской латинской букве каждый день с примерами.

source: Legacy · 32 letters · Acute accents
kk: Ескі · 32 әріп · Акуттар
ru: Старый · 32 буквы · Акуты

source: Legacy · 2018
kk: Ескі · 2018
ru: Старый · 2018

source: Legacy 2018
kk: Ескі 2018
ru: Старый 2018

source: Legacy 2018 (á, ó, ú)
kk: Ескі 2018 (á, ó, ú)
ru: Старый 2018 (á, ó, ú)

source: Letter of the day
kk: Күннің әрпі
ru: Буква дня

source: Letter of the Day
kk: Күннің әрпі
ru: Буква дня

source: LETTER OF THE DAY
kk: КҮННІҢ ӘРПІ
ru: БУКВА ДНЯ

source: Light
kk: Ашық
ru: Светлая

source: Live scanning requires a physical device. Choose a photo to scan text from an image.
kk: Тікелей сканерлеу құрылғыда қолжетімді.\nМәтінді тану үшін фото таңдаңыз.
ru: Сканирование доступно на устройстве.\nВыберите фото для распознавания текста.

source: Modern · 31 letters · Diacritics
kk: Жаңа · 31 әріп · Диакритика
ru: Новый · 31 буква · Диакритика

source: No conversions yet
kk: Түрлендірулер жоқ
ru: Пока нет конверсий

source: No favorites yet
kk: Таңдаулы жоқ
ru: Нет избранного

# NSCameraUsageDescription
source: Camera is used to scan and recognize Kazakh text for conversion.
kk: Камера қазақ мәтінін сканерлеу және түрлендіру үшін тану мақсатында қолданылады.
ru: Камера используется для сканирования и распознавания казахского текста для конвертации.

# NSPhotoLibraryUsageDescription
source: Photo access is used to recognize text in your images.
kk: Фотоға қолжетімділік суреттеріңіздегі мәтінді тану үшін қолданылады.
ru: Доступ к фото используется для распознавания текста на ваших изображениях.

source: OCR Result
kk: OCR нәтижесі
ru: Результат OCR

source: OK
kk: ОК
ru: ОК

source: Original
kk: Бастапқы
ru: Исходный

source: Paste
kk: Қою
ru: Вставить

source: PDF Document
kk: PDF құжаты
ru: PDF-документ

source: Plain Text
kk: Қарапайым мәтін
ru: Простой текстовый файл

source: Preferences
kk: Параметрлер
ru: Настройки

source: Privacy Policy
kk: Құпиялылық саясаты
ru: Политика конфиденциальности

source: Recognized
kk: Танылды
ru: Распознано

source: Recommended
kk: Ұсынылады
ru: Рекомендуется

source: Russian
kk: Орысша
ru: Русский

source: Russian and Kazakh
kk: Орыс және қазақ
ru: Русский и казахский

source: Save
kk: Сақтау
ru: Сохранить

source: Save conversions automatically
kk: Түрлендірулерді автосақтау
ru: Автосохранение конверсий

source: Save your most-used conversions for quick access.
kk: Жиі қолданылатын түрлендірулерді жылдам қол жеткізу үшін сақтаңыз.
ru: Сохраняйте часто используемые конверсии для быстрого доступа.

source: Saved to history
kk: Тарихқа сақталды
ru: Сохранено в историю

source: Scan Result
kk: Сканерлеу нәтижесі
ru: Результат сканирования

source: Scanning text...
kk: Сканерлеу...
ru: Сканирование...

source: Search conversions...
kk: Іздеу...
ru: Поиск...

source: See today's letter right on your home screen.
kk: Күннің әрпін басты экранда көріңіз.
ru: Видите букву дня прямо на главном экране.

source: Select
kk: Таңдау
ru: Выбрать

source: Select All
kk: Барлығын таңдау
ru: Выбрать все

source: Select to Export
kk: Экспорттау үшін таңдау
ru: Выбрать для экспорта

source: Selected Conversions
kk: Таңдалған түрлендірулер
ru: Выбранные конверсии

source: Selected items
kk: Таңдалған элементтер
ru: Выбранные элементы

source: Settings
kk: Параметрлер
ru: Настройки

source: Share
kk: Бөлісу
ru: Поделиться

source: Share Extension
kk: «Бөлісу» кеңейтімі
ru: Расширение «Поделиться»

source: Share Text
kk: Мәтінді бөлісу
ru: Поделиться текстом

source: Share your conversions as professional documents.
kk: Түрлендірулермен кәсіби құжаттар ретінде бөлісіңіз.
ru: Делитесь своими конверсиями как профессиональными документами.

source: Simple .txt file
kk: Қарапайым .txt файлы
ru: Простой текстовый файл

source: Skip
kk: Өткізу
ru: Пропустить

source: Smart direction
kk: Ақылды бағыт
ru: Умное направление

source: Source
kk: Дерек көзі
ru: Источник

source: Standard
kk: Стандарт
ru: Стандарт

source: Standard · 2021
kk: Стандарт · 2021
ru: Стандарт · 2021

source: Standard 2021
kk: Стандарт 2021
ru: Стандарт 2021

source: Standard 2021 (ä, ö, ü, ş) ✓
kk: Стандарт 2021 (ä, ö, ü, ş) ✓
ru: Стандарт 2021 (ä, ö, ü, ş) ✓

source: Standards
kk: Стандарттар
ru: Стандарты

source: System
kk: Жүйелік
ru: Системная

source: Tap recognized text to convert
kk: Түрлендіру үшін мәтінге басыңыз
ru: Нажмите на текст для конверсии

source: Tap the star on any conversion to save it here.
kk: Оны осында сақтау үшін кез келген түрлендірудегі жұлдызшаны басыңыз.
ru: Нажмите звезду на любой конверсии, чтобы сохранить её здесь.

source: Text detected in clipboard
kk: Буферде мәтін табылды
ru: Текст в буфере обмена

source: This action cannot be undone.
kk: Бұл әрекетті қайтару мүмкін емес.
ru: Это действие нельзя отменить.

source: This Conversion
kk: Бұл түрлендіру
ru: Эта конверсия

source: Today
kk: Бүгін
ru: Сегодня

source: Try an example
kk: Мысалды көру
ru: Попробовать пример

source: Try this example
kk: Мысалды көру
ru: Попробовать пример

source: Unfavorite
kk: Алып тастау
ru: Из избранного

source: Use the app in your language. Switch anytime in Settings.
kk: Қолданбаны өз тіліңізде пайдаланыңыз. Кез келген уақытта Параметрлерден ауыстырыңыз.
ru: Используйте приложение на своём языке. Переключайтесь в Настройках.

source: Version
kk: Нұсқа
ru: Версия

source: What to export
kk: Нені экспорттау керек
ru: Что экспортировать

source: What's New in
kk: Не жаңалық бар
ru: Что нового в

source: Кириллица
kk: Кирилл

source: Мәтінді жазыңыз...
ru: Введите текст...
